In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
#this is how you connect to the database!
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman-baseball")

In [ ]:
# using the connection to run a query using pandas (bringing in the batting table)
batting = pd.read_sql("SELECT * FROM batting;", con=engine)

In [ ]:
batting.head(2)

# Question 1 
## a. Find all players in the database who played at Vanderbilt University.
    ### print(unique_vandy_players)
## b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.
    ### print(vandy_players2)
## c. Sort this list in descending order by the total salary earned.
    ### print(vandy_players2)
## d. Which Vanderbilt player earned the most money in the majors?
    ### David Price

In [ ]:
#read in the schools, people, salaries and collegeplayers tables

In [3]:
schools = pd.read_sql("SELECT * FROM Schools;", con=engine) #1207 rows
college_players = pd.read_sql("SELECT * FROM CollegePlaying;", con=engine) #17350 rows
player_info = pd.read_sql("SELECT * FROM people;", con=engine)
salaries = pd.read_sql("SELECT * FROM salaries;", con=engine)
people = pd.read_sql("SELECT * FROM people;", con=engine) #19112 rows

In [8]:
people.info() #17350 rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19112 entries, 0 to 19111
Data columns (total 24 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   playerid      19112 non-null  object
 1   birthyear     18980 non-null  float64
 2   birthmonth    18810 non-null  float64
 3   birthday      18663 non-null  float64
 4   birthcountry  19043 non-null  object
 5   birthstate    18541 non-null  object
 6   birthcity     18932 non-null  object
 7   deathyear     9450 non-null   float64
 8   deathmonth    9449 non-null   float64
 9   deathday      9448 non-null   float64
 10  deathcountry  9445 non-null   object
 11  deathstate    9400 non-null   object
 12  deathcity     9441 non-null   object
 13  namefirst     19075 non-null  object
 14  namelast      19112 non-null  object
 15  namegiven     19075 non-null  object
 16  weight        18261 non-null  float64
 17  height        18330 non-null  float64
 18  bats          17929 non-null  object
 19  throws        18135 non-null  object
 20  debut         18917 non-null  object
 21  finalgame     18917 non-null  object
 22  retroid       19049 non-null  object
 23  bbrefid       19103 non-null  object
dtypes: float64(8), object(16)
memory usage: 3.5+ MB

In [ ]:
college_players.head()

In [ ]:
salaries.head()

In [ ]:
q1_1 = pd.merge(schools, college_players, on=['schoolid'])

In [ ]:
q1_1

In [16]:
#A merge of college_players and people (should remove people who didn't go to college)
people_college = people.merge(college_players, how='inner', on='playerid')
people_college.info #17350 rows × 26 columns
#type(people_college)

<bound method DataFrame.info of         playerid  birthyear  birthmonth  birthday birthcountry birthstate  \
0      aardsda01     1981.0        12.0      27.0          USA         CO
1      aardsda01     1981.0        12.0      27.0          USA         CO
2      aardsda01     1981.0        12.0      27.0          USA         CO
3       abadan01     1972.0         8.0      25.0          USA         FL
4       abadan01     1972.0         8.0      25.0          USA         FL
...          ...        ...         ...       ...          ...        ...
17345  zupcibo01     1966.0         8.0      18.0          USA         PA
17346  zuvelpa01     1958.0        10.0      31.0          USA         CA
17347  zuvelpa01     1958.0        10.0      31.0          USA         CA
17348  zuvelpa01     1958.0        10.0      31.0          USA         CA
17349  zuvelpa01     1958.0        10.0      31.0          USA         CA

        birthcity  deathyear  deathmonth  deathday  ... weight height bats  \
0          Denver        NaN         NaN       NaN  ...  215.0   75.0    R
1          Denver        NaN         NaN       NaN  ...  215.0   75.0    R
2          Denver        NaN         NaN       NaN  ...  215.0   75.0    R
3      Palm Beach        NaN         NaN       NaN  ...  184.0   73.0    L
4      Palm Beach        NaN         NaN       NaN  ...  184.0   73.0    L
...           ...        ...         ...       ...  ...    ...    ...  ...
17345  Pittsburgh        NaN         NaN       NaN  ...  220.0   76.0    R
17346   San Mateo        NaN         NaN       NaN  ...  173.0   72.0    R
17347   San Mateo        NaN         NaN       NaN  ...  173.0   72.0    R
17348   San Mateo        NaN         NaN       NaN  ...  173.0   72.0    R
17349   San Mateo        NaN         NaN       NaN  ...  173.0   72.0    R

      throws       debut   finalgame   retroid    bbrefid  schoolid yearid
0          R  2004-04-06  2015-08-23  aardd001  aardsda01    pennst   2001
1          R  2004-04-06  2015-08-23  aardd001  aardsda01      rice   2002
2          R  2004-04-06  2015-08-23  aardd001  aardsda01      rice   2003
3          L  2001-09-10  2006-04-13  abada001   abadan01   gamiddl   1992
4          L  2001-09-10  2006-04-13  abada001   abadan01   gamiddl   1993
...      ...         ...         ...       ...        ...       ...    ...
17345      R  1991-09-07  1994-08-04  zupcb001  zupcibo01   oralrob   1987
17346      R  1982-09-04  1991-05-02  zuvep001  zuvelpa01  stanford   1977
17347      R  1982-09-04  1991-05-02  zuvep001  zuvelpa01  stanford   1978
17348      R  1982-09-04  1991-05-02  zuvep001  zuvelpa01  stanford   1979
17349      R  1982-09-04  1991-05-02  zuvep001  zuvelpa01  stanford   1980

[17350 rows x 26 columns]>

In [ ]:
schools.head()

In [15]:
#Bringing schools into the people_college table (should be no NULLS since folks in the people_college table went to college)
people_college2 = people_college.merge(schools, on='schoolid')
people_college2.info #17340 rows...why would I lose rows???
#type(people_college2)

<bound method DataFrame.info of         playerid  birthyear  birthmonth  birthday birthcountry birthstate  \
0      aardsda01     1981.0        12.0      27.0          USA         CO
1      atherch01     1873.0        11.0      19.0          USA         NJ
2      atherch01     1873.0        11.0      19.0          USA         NJ
3      atherch01     1873.0        11.0      19.0          USA         NJ
4      baldwma01     1863.0        10.0      29.0          USA         PA
...          ...        ...         ...       ...          ...        ...
17335  yatesty01     1977.0         8.0       7.0          USA         HI
17336  yatesty01     1977.0         8.0       7.0          USA         HI
17337  yellela01     1943.0         1.0       4.0          USA         NY
17338  zabelzi01     1891.0         2.0      18.0          USA         KS
17339  zabelzi01     1891.0         2.0      18.0          USA         KS

           birthcity  deathyear  deathmonth  deathday  ...       debut  \
0             Denver        NaN         NaN       NaN  ...  2004-04-06
1      New Brunswick     1935.0        12.0      17.0  ...  1899-05-30
2      New Brunswick     1935.0        12.0      17.0  ...  1899-05-30
3      New Brunswick     1935.0        12.0      17.0  ...  1899-05-30
4         Pittsburgh     1929.0        11.0      10.0  ...  1887-05-02
...              ...        ...         ...       ...  ...         ...
17335          Lihue        NaN         NaN       NaN  ...  2004-04-09
17336          Lihue        NaN         NaN       NaN  ...  2004-04-09
17337       Brooklyn        NaN         NaN       NaN  ...  1963-09-26
17338        Wetmore     1970.0         5.0      31.0  ...  1913-10-05
17339        Wetmore     1970.0         5.0      31.0  ...  1913-10-05

        finalgame   retroid    bbrefid    schoolid yearid  \
0      2015-08-23  aardd001  aardsda01      pennst   2001
1      1899-08-22  athec101  atherch01      pennst   1893
2      1899-08-22  athec101  atherch01      pennst   1894
3      1899-08-22  athec101  atherch01      pennst   1895
4      1893-09-30  baldm101  baldwma01      pennst   1882
...           ...       ...        ...         ...    ...
17335  2009-05-15  yatet001  yatesty01  hawaiihilo   1997
17336  2009-05-15  yatet001  yatesty01  hawaiihilo   1998
17337  1964-10-03  yelll101  yellela01  huntercuny   1962
17338  1915-09-29  zabez101  zabelzi01     bakerks   1911
17339  1915-09-29  zabez101  zabelzi01     bakerks   1912

                                            schoolname     schoolcity  \
0                        Pennsylvania State University  State College
1                        Pennsylvania State University  State College
2                        Pennsylvania State University  State College
3                        Pennsylvania State University  State College
4                        Pennsylvania State University  State College
...                                                ...            ...
17335                     University of Hawaii at Hilo           Hilo
17336                     University of Hawaii at Hilo           Hilo
17337  Hunter College, The City University of New York       New York
17338                                 Baker University   Baldwin City
17339                                 Baker University   Baldwin City

      schoolstate schoolnick
0              PA        USA
1              PA        USA
2              PA        USA
3              PA        USA
4              PA        USA
...           ...        ...
17335          HI        USA
17336          HI        USA
17337          NY        USA
17338          KS        USA
17339          KS        USA

[17340 rows x 30 columns]>

In [30]:
#Trim out columns I don't need but making a new dataframe out of people_college2
#includes columns from schools, people, college_players now
people_college3 = people_college2[['playerid', 'namefirst', 'namelast', 'schoolid', 'schoolname']]
people_college3.info() #17340 rows x 5 columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17340 entries, 0 to 17339
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   playerid    17340 non-null  object
 1   namefirst   17340 non-null  object
 2   namelast    17340 non-null  object
 3   schoolid    17340 non-null  object
 4   schoolname  17340 non-null  object
dtypes: object(5)
memory usage: 812.8+ KB

In [31]:
people_college3.set_index('playerid', inplace=True)

In [35]:
#Vanderbilt players only
vandy = people_college3[people_college3['schoolid'] == 'vandy']
#Trying to compare Index or Series objects of different lengths will raise a ValueError:
vandy.info() #65 rows

<class 'pandas.core.frame.DataFrame'>
Index: 65 entries, alvarpe01 to zeidjo01
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   namefirst   65 non-null     object
 1   namelast    65 non-null     object
 2   schoolid    65 non-null     object
 3   schoolname  65 non-null     object
dtypes: object(4)
memory usage: 2.5+ KB

          namefirst namelast schoolid             schoolname
playerid
alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University
alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University
alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University
baxtemi01      Mike   Baxter    vandy  Vanderbilt University
baxtemi01      Mike   Baxter    vandy  Vanderbilt University
...             ...      ...      ...                    ...
willimi01      Mike   Willis    vandy  Vanderbilt University
willimi01      Mike   Willis    vandy  Vanderbilt University
willimi01      Mike   Willis    vandy  Vanderbilt University
zeidjo01       Josh     Zeid    vandy  Vanderbilt University
zeidjo01       Josh     Zeid    vandy  Vanderbilt University

[65 rows x 4 columns]

In [40]:
#bring in the money
vandy_money = vandy.merge(salaries, how ='inner', on='playerid')
vandy_money.head()

,playerid,namefirst,namelast,schoolid,schoolname,yearid,teamid,lgid,salary
0,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,2011,PIT,NL,2050000.0
1,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,2012,PIT,NL,2200000.0
2,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,2013,PIT,NL,700000.0
3,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,2014,PIT,NL,4250000.0
4,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,2015,PIT,NL,5750000.0

In [43]:
#group the players' salaries so that they are summed up
vandy_money2 = vandy_money.groupby(['playerid'])['salary'].sum()
type(vandy_money2) #it's a series now...convert back to dataframe?
vandy_money2

playerid
alvarpe01     62045112.0
baxtemi01      4188836.0
chrisni01      2000000.0
corajo01      16867500.0
flahery01     12183000.0
grayso01       4627500.0
katama01       3180000.0
lewisje01      3702000.0
madissc01       540000.0
minormi01     20512500.0
pauljo01       7920000.0
priceda01    245553888.0
priorma01     12800000.0
sandesc01     21500000.0
sowerje01      1154400.0
Name: salary, dtype: float64

In [45]:
#convert vandy_money2 to dataframe
vandy_money3 = pd.DataFrame(vandy_money2)
#not sure if this step is needed but doing it anyway
vandy_money3 = vandy_money3.reset_index()

In [47]:
#ok, merge the grouped salary dataframe back to the vandy players.  Left join
vandy_players2 = vandy.merge(vandy_money3, how='left', on='playerid')
vandy_players2

     playerid namefirst namelast schoolid             schoolname      salary
0   alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University  62045112.0
1   alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University  62045112.0
2   alvarpe01     Pedro  Alvarez    vandy  Vanderbilt University  62045112.0
3   baxtemi01      Mike   Baxter    vandy  Vanderbilt University   4188836.0
4   baxtemi01      Mike   Baxter    vandy  Vanderbilt University   4188836.0
..        ...       ...      ...      ...                    ...         ...
60  willimi01      Mike   Willis    vandy  Vanderbilt University         NaN
61  willimi01      Mike   Willis    vandy  Vanderbilt University         NaN
62  willimi01      Mike   Willis    vandy  Vanderbilt University         NaN
63   zeidjo01      Josh     Zeid    vandy  Vanderbilt University         NaN
64   zeidjo01      Josh     Zeid    vandy  Vanderbilt University         NaN

[65 rows x 6 columns]

In [49]:
#make it pretty
vandy_players2 = vandy_players2.drop_duplicates()
vandy_players2 = vandy_players2.sort_values('salary', ascending = False)
vandy_players2['full_name'] = vandy_players2['namefirst'] + " " + vandy_players2['namelast']
vandy_players2

,playerid,namefirst,namelast,schoolid,schoolname,salary,full_name
47,priceda01,David,Price,vandy,Vanderbilt University,245553888.0,David Price
0,alvarpe01,Pedro,Alvarez,vandy,Vanderbilt University,62045112.0,Pedro Alvarez
54,sandesc01,Scott,Sanderson,vandy,Vanderbilt University,21500000.0,Scott Sanderson
35,minormi01,Mike,Minor,vandy,Vanderbilt University,20512500.0,Mike Minor
14,corajo01,Joey,Cora,vandy,Vanderbilt University,16867500.0,Joey Cora
50,priorma01,Mark,Prior,vandy,Vanderbilt University,12800000.0,Mark Prior
18,flahery01,Ryan,Flaherty,vandy,Vanderbilt University,12183000.0,Ryan Flaherty
46,pauljo01,Josh,Paul,vandy,Vanderbilt University,7920000.0,Josh Paul
21,grayso01,Sonny,Gray,vandy,Vanderbilt University,4627500.0,Sonny Gray
4,baxtemi01,Mike,Baxter,vandy,Vanderbilt University,4188836.0,Mike Baxter
28,lewisje01,Jensen,Lewis,vandy,Vanderbilt University,3702000.0,Jensen Lewis
27,katama01,Matt,Kata,vandy,Vanderbilt University,3180000.0,Matt Kata
8,chrisni01,Nick,Christiani,vandy,Vanderbilt University,2000000.0,Nick Christiani
57,sowerje01,Jeremy,Sowers,vandy,Vanderbilt University,1154400.0,Jeremy Sowers
34,madissc01,Scotti,Madison,vandy,Vanderbilt University,540000.0,Scotti Madison
9,colliwi01,Wilson,Collins,vandy,Vanderbilt University,NaN,Wilson Collins
15,embresl01,Slim,Embry,vandy,Vanderbilt University,NaN,Slim Embry
24,hendrha01,Harvey,Hendrick,vandy,Vanderbilt University,NaN,Harvey Hendrick
38,mooresc01,Scrappy,Moore,vandy,Vanderbilt University,NaN,Scrappy Moore
41,mossma01,Mal,Moss,vandy,Vanderbilt University,NaN,Mal Moss
51,richaan01,Antoan,Richardson,vandy,Vanderbilt University,NaN,Antoan Richardson
55,sewelri01,Rip,Sewell,vandy,Vanderbilt University,NaN,Rip Sewell
60,willimi01,Mike,Willis,vandy,Vanderbilt University,NaN,Mike Willis
63,zeidjo01,Josh,Zeid,vandy,Vanderbilt University,NaN,Josh Zeid